# Dataframe

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [12]:
df = pd.DataFrame(randn(5,4),index = 'A B C D E'.split(),columns = 'W X Y Z'.split())

In [13]:
df

          W         X         Y         Z
A  1.844307 -1.446910  0.637493 -0.337594
B  1.949239 -0.153361  0.192761  1.051628
C  0.028070  1.944474  0.881697  0.104723
D  0.394936  0.303308  0.694464  1.079296
E  0.843331 -0.985839  0.971965 -0.838361

In [18]:
df[['W','Y']]

          W         Y
A  1.844307  0.637493
B  1.949239  0.192761
C  0.028070  0.881697
D  0.394936  0.694464
E  0.843331  0.971965

In [33]:
df['new'] = df['W'] + df['Y']

In [34]:
df

          W         X         Y         Z       new
A  1.844307 -1.446910  0.637493 -0.337594  2.481800
B  1.949239 -0.153361  0.192761  1.051628  2.142000
C  0.028070  1.944474  0.881697  0.104723  0.909767
D  0.394936  0.303308  0.694464  1.079296  1.089401
E  0.843331 -0.985839  0.971965 -0.838361  1.815296

In [36]:
df.drop('new',axis=1,inplace=True) #inplace gives condition to perform the method.
                                # false performs the operation temporarily.

In [37]:
df

          W         X         Y         Z
A  1.844307 -1.446910  0.637493 -0.337594
B  1.949239 -0.153361  0.192761  1.051628
C  0.028070  1.944474  0.881697  0.104723
D  0.394936  0.303308  0.694464  1.079296
E  0.843331 -0.985839  0.971965 -0.838361

In [38]:
df.loc['A']

W    1.844307
X   -1.446910
Y    0.637493
Z   -0.337594
Name: A, dtype: float64

In [40]:
df.iloc[0]

W    1.844307
X   -1.446910
Y    0.637493
Z   -0.337594
Name: A, dtype: float64

In [41]:
df['W'].mean()

1.0119766381595103

In [42]:
df['X'].median()

-0.15336120875083487

In [43]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   1.011977 -0.067666  0.675676  0.211938
std    0.858558  1.317102  0.302180  0.847643
min    0.028070 -1.446910  0.192761 -0.838361
25%    0.394936 -0.985839  0.637493 -0.337594
50%    0.843331 -0.153361  0.694464  0.104723
75%    1.844307  0.303308  0.881697  1.051628
max    1.949239  1.944474  0.971965  1.079296

# Titanic Dataset

In [44]:
train = pd.read_csv('titanic_train.csv')

In [49]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [48]:
train.columns[train.isnull().any()]

Index(['Age', 'Cabin', 'Embarked'], dtype='object')

In [52]:
train.columns[train.isnull().all()]

Index([], dtype='object')

In [53]:
train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [54]:
train.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [55]:
train['Age'] = train['Age'].fillna(train['Age'].mean())

# Matplotlib and Seaborn

In [57]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline